Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ64GB202.h
#define _T3CON_TECS0_POSITION                    0x00000008
#define _T3CON_TECS0_MASK                        0x00000100
#define _T3CON_TECS0_LENGTH                      0x00000001

#define _T3CON_TECS1_POSITION                    0x00000009
#define _T3CON_TECS1_MASK                        0x00000200
#define _T3CON_TECS1_LENGTH                      0x00000001

#define _T3CON_TIECS_POSITION                    0x00000008
#define _T3CON_TIECS_MASK                        0x00000300
#define _T3CON_TIECS_LENGTH                      0x00000002

#define _T3CON_TIECS0_POSITION                   0x00000008
#define _T3CON_TIECS0_MASK                       0x00000100
#define _T3CON_TIECS0_LENGTH                     0x00000001

#define _T3CON_TIECS1_POSITION                   0x00000009
#define _T3CON_TIECS1_MASK                       0x00000200
#define _T3CON_TIECS1_LENGTH                     0x00000001

#define _T4CON_TCS_POSITION                      0x00000001
#define _T4CON_TCS_MASK                          0x00000002
#define _T4CON_TCS_LENGTH                        0x00000001

#define _T4CON_T32_POSITION                      0x00000003
#define _T4CON_T32_MASK                          0x00000008
#define _T4CON_T32_LENGTH                        0x00000001

#define _T4CON_TCKPS_POSITION                    0x00000004
#define _T4CON_TCKPS_MASK                        0x00000030
#define _T4CON_TCKPS_LENGTH                      0x00000002

#define _T4CON_TGATE_POSITION                    0x00000006
#define _T4CON_TGATE_MASK                        0x00000040
#define _T4CON_TGATE_LENGTH                      0x00000001

#define _T4CON_TECS_POSITION                     0x00000008
#define _T4CON_TECS_MASK                         0x00000300
#define _T4CON_TECS_LENGTH                       0x00000002

#define _T4CON_TSIDL_POSITION                    0x0000000D
#define _T4CON_TSIDL_MASK                        0x00002000
#define _T4CON_TSIDL_LENGTH                      0x00000001

#define _T4CON_TON_POSITION                      0x0000000F
#define _T4CON_TON_MASK                          0x00008000
#define _T4CON_TON_LENGTH                        0x00000001

#define _T4CON_TCKPS0_POSITION                   0x00000004
#define _T4CON_TCKPS0_MASK                       0x00000010
#define _T4CON_TCKPS0_LENGTH                     0x00000001

#define _T4CON_TCKPS1_POSITION                   0x00000005
#define _T4CON_TCKPS1_MASK                       0x00000020
#define _T4CON_TCKPS1_LENGTH                     0x00000001

#define _T4CON_TECS0_POSITION                    0x00000008
#define _T4CON_TECS0_MASK                        0x00000100
#define _T4CON_TECS0_LENGTH                      0x00000001

#define _T4CON_TECS1_POSITION                    0x00000009
#define _T4CON_TECS1_MASK                        0x00000200
#define _T4CON_TECS1_LENGTH                      0x00000001

#define _T4CON_TIECS_POSITION                    0x00000008
#define _T4CON_TIECS_MASK                        0x00000300
#define _T4CON_TIECS_LENGTH                      0x00000002

#define _T4CON_TIECS0_POSITION                   0x00000008
#define _T4CON_TIECS0_MASK                       0x00000100
#define _T4CON_TIECS0_LENGTH                     0x00000001

#define _T4CON_TIECS1_POSITION                   0x00000009
#define _T4CON_TIECS1_MASK                       0x00000200
#define _T4CON_TIECS1_LENGTH                     0x00000001

#define _T4CON_T45_POSITION                      0x00000003
#define _T4CON_T45_MASK                          0x00000008
#define _T4CON_T45_LENGTH                        0x00000001

#define _T5CON_TCS_POSITION                      0x00000001
#define _T5CON_TCS_MASK                          0x00000002
#define _T5CON_TCS_LENGTH                        0x00000001

#define _T5CON_TCKPS_POSITION                    0x00000004
#define _T5CON_TCKPS_MASK                        0x00000030
#define _T5CON_TCKPS_LENGTH                      0x00000002

#define _T5CON_TGATE_POSITION                    0x00000006
#define _T5CON_TGATE_MASK                        0x00000040
#define _T5CON_TGATE_LENGTH                      0x00000001

#define _T5CON_TECS_POSITION                     0x00000008
#define _T5CON_TECS_MASK                         0x00000300
#define _T5CON_TECS_LENGTH                       0x00000002

#define _T5CON_TSIDL_POSITION                    0x0000000D
#define _T5CON_TSIDL_MASK                        0x00002000
#define _T5CON_TSIDL_LENGTH                      0x00000001

#define _T5CON_TON_POSITION                      0x0000000F
#define _T5CON_TON_MASK                          0x00008000
#define _T5CON_TON_LENGTH                        0x00000001

#define _T5CON_TCKPS0_POSITION                   0x00000004
#define _T5CON_TCKPS0_MASK                       0x00000010
#define _T5CON_TCKPS0_LENGTH                     0x00000001

#define _T5CON_TCKPS1_POSITION                   0x00000005
#define _T5CON_TCKPS1_MASK                       0x00000020
#define _T5CON_TCKPS1_LENGTH                     0x00000001

#define _T5CON_TECS0_POSITION                    0x00000008
#define _T5CON_TECS0_MASK                        0x00000100
#define _T5CON_TECS0_LENGTH                      0x00000001

#define _T5CON_TECS1_POSITION                    0x00000009
#define _T5CON_TECS1_MASK                        0x00000200
#define _T5CON_TECS1_LENGTH                      0x00000001

#define _T5CON_TIECS_POSITION                    0x00000008
#define _T5CON_TIECS_MASK                        0x00000300
#define _T5CON_TIECS_LENGTH                      0x00000002

#define _T5CON_TIECS0_POSITION                   0x00000008
#define _T5CON_TIECS0_MASK                       0x00000100
#define _T5CON_TIECS0_LENGTH                     0x00000001

#define _T5CON_TIECS1_POSITION                   0x00000009
#define _T5CON_TIECS1_MASK                       0x00000200
#define _T5CON_TIECS1_LENGTH                     0x00000001

#define _OC1CON1_OCM_POSITION                    0x00000000
#define _OC1CON1_OCM_MASK                        0x00000007
#define _OC1CON1_OCM_LENGTH                      0x00000003

#define _OC1CON1_TRIGMODE_POSITION               0x00000003
#define _OC1CON1_TRIGMODE_MASK                   0x00000008
#define _OC1CON1_TRIGMODE_LENGTH                 0x00000001

#define _OC1CON1_OCFLTA_POSITION                 0x00000004
#define _OC1CON1_OCFLTA_MASK                     0x00000010
#define _OC1CON1_OCFLTA_LENGTH                   0x00000001

#define _OC1CON1_OCFLTB_POSITION                 0x00000005
#define _OC1CON1_OCFLTB_MASK                     0x00000020
#define _OC1CON1_OCFLTB_LENGTH                   0x00000001

#define _OC1CON1_OCFLTC_POSITION                 0x00000006
#define _OC1CON1_OCFLTC_MASK                     0x00000040
#define _OC1CON1_OCFLTC_LENGTH                   0x00000001

#define _OC1CON1_ENFLTA_POSITION                 0x00000007
#define _OC1CON1_ENFLTA_MASK                     0x00000080
#define _OC1CON1_ENFLTA_LENGTH                   0x00000001

#define _OC1CON1_ENFLTB_POSITION                 0x00000008
#define _OC1CON1_ENFLTB_MASK                     0x00000100
#define _OC1CON1_ENFLTB_LENGTH                   0x00000001

#define _OC1CON1_ENFLTC_POSITION                 0x00000009
#define _OC1CON1_ENFLTC_MASK                     0x00000200
#define _OC1CON1_ENFLTC_LENGTH                   0x00000001

#define _OC1CON1_OCTSEL_POSITION                 0x0000000A
#define _OC1CON1_OCTSEL_MASK                     0x00001C00
#define _OC1CON1_OCTSEL_LENGTH                   0x00000003

